---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartCannotChangeTypeIncompatError
source: html/065a0de4-c1a5-5745-54e7-923b75a2ddaf.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartCannotChangeTypeIncompatError Property

The selected fitting(s) cannot successfully change the type. The newly selected fabrication part type either has no material or has badly configured dimensions, resulting in bad geometry. You may try to disconnect the connections on the fitting(s) and try again.

## Syntax (C#)
```csharp
public static FailureDefinitionId FabricationPartCannotChangeTypeIncompatError { get; }
```